{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "QtE6SrPxqCEa"
   },
   "source": [
    "# ЛР №2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "BdJ50qlUpsS3"
   },
   "source": [
    "**Задача 1**\n",
    "\n",
    "Даны два списка `a` и `b` (см. ниже).\n",
    "    \n",
    "1. Выведите на экран первый элемент списка `a`, третий элемент списка `a`, последний элемент списка `a`.\n",
    "2. Добавьте в список `b` элемент 7 (просто допишите в конец).\n",
    "3. Замените пятый элемент списка `a` на число 8.\n",
    "4. Создайте список `merged`, который включает в себя все элементы списка `a` и списка `b`.\n",
    "5. Создайте новый список `с`, который получается заменой последнего элемента списка `a` на число 100. Сам список `a` измениться не должен!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "3rHw5j53psS4"
   },
   "outputs": [],
   "source": [
    "a = [1, 0, 9, 12, 18, 34, 89, 91, 33, 127]\n",
    "b = [2, 8, 9, 11, 76, 25, 44]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "y4s_SJZzpsS5"
   },
   "source": [
    "**Задача 2**\n",
    "\n",
    "Есть список имен:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "QSM6QXwppsS5"
   },
   "outputs": [],
   "source": [
    "girls = [\"Иветта\", \"Виолетта\", \"Кассандра\", \"Вирджиния\", \"Амелия\", \"Розамунда\", \"Янина\", \"Беатриса\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "LefMreifpsS6"
   },
   "source": [
    "Используя список `girls`, выведите на экран следующие списки:\n",
    "\n",
    "    [\"Виолетта\", \"Кассандра\", \"Вирджиния\", \"Амелия\"]\n",
    "    [\"Вирджиния\", \"Амелия\", \"Розамунда\", \"Янина\", \"Беатриса\"]\n",
    "    [\"Иветта\", \"Виолетта\", \"Вирджиния\", \"Амелия\"]\n",
    "    [\"Кассандра\", \"Амелия\", \"Розамунда\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "2ze0k0HxpsS6"
   },
   "source": [
    "**Задача 3**\n",
    "\n",
    "Дан список `L`. Выведите на экран (последовательно, с новой строчки):\n",
    "\n",
    "* все элементы списка `L`;\n",
    "* логарифмированные значения элементов списка `L`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "S_m2uMT8psS7"
   },
   "outputs": [],
   "source": [
    "L = [12, 3, 8, 125, 10, 98, 54, 199]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "-uD4ULVppsS8"
   },
   "source": [
    "**Задача 4**\n",
    "\n",
    "В списке `age` сохранены значения возраста респондентов:\n",
    "\n",
    "    age = [24, 35, 42, 27, 45, 48, 33]\n",
    "    \n",
    "Создайте список `age2`, в котором будут храниться значения возраста, возведенные в квадрат.\n",
    "\n",
    "**Подсказка:** используйте цикл `for`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "ETOgag24psS9"
   },
   "source": [
    "**Задача 5**\n",
    "Необходимо ввести с клавиатуры целое число $k$ от 1 до 10 и вывести на экран $k$-тый элемент списка `numbers`, причем $k$-ый элемент в привычном понимании, в нумерации, которая начинается с единицы.  \n",
    "\n",
    "Список `numbers`:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "mh0OCrsRpsS9"
   },
   "outputs": [],
   "source": [
    "numbers = [1, 5, 6, 8, 10, 21, 25, 1, 0, -9, 9]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "bkfI5BC2psS-"
   },
   "source": [
    "**Пояснение:**\n",
    "    \n",
    "*Входные данные:*\n",
    "\n",
    "    Введите целое число от 1 до 10: 3\n",
    "    \n",
    "*Выходные данные:*\n",
    "\n",
    "    6"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "L5V6XjEIpsS-"
   },
   "source": [
    "**Задача 6**\n",
    "\n",
    "Объясните, что делает следующий код и почему он выдает такие результаты:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "DabOIvYxpsS-",
    "outputId": "38d1132c-bd80-4216-ddb2-72556c637c69"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "3\n",
      "5\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "l = [1,2,3,4]\n",
    "\n",
    "for i in range(len(l)):\n",
    "    a = l[i] + l[i-1]\n",
    "    print(a)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "EyQhlPcZscF4"
   },
   "source": [
    "**Задача 7**\n",
    "\n",
    "Напишите программу, которая просит пользователя ввести положительное число, и если пользователь вводит положительное число, выводит на экран сообщение \"Отлично!\", если нет ‒ \"Это не положительное число.\".\n",
    "\n",
    "Считайте, что пользователь в любом случае вводит числа, а не какой-то текст."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "o5c4t71L-EpS"
   },
   "source": [
    "**Задача со звездочкой**\n",
    "\n",
    "Дан список строк, необходимо написать функцию, такую, которая будет возвращать этот же список строк, но с длиной строк, равной длине максимальной строки в списке (недостающие символы дополнять нижним подчеркиванием). Например, [v, bn, nnn] -> [v__, bn_, nnn]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "Kyne7YsICAWD"
   },
   "source": [
    "**Задача со звездочкой**\n",
    "\n",
    "Вывести все подмассивы (без перекрытия) и их позицию из списка, сумма внутри которых равна 5.\n",
    "\n",
    "Например, [1, 2, 3, 4, 0, 1, 0, 1, 5, 4, 3, 4, 1, 1, 1, 0, 0, 1, 1, 1] ->\n",
    "\n",
    "[2, 3], позиции 1-2\n",
    "\n",
    "[4, 0, 1], позиции 3-5\n",
    "\n",
    "[5], позиции 8-8\n",
    "\n",
    "[4, 1], позиции 11-12\n",
    "\n",
    "[1, 1, 0, 0, 1, 1, 1], позиции 13-19"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "u9Qns_OZDsZk"
   },
   "source": [
    "**Задача со звездочкой**\n",
    "\n",
    "Вы выбираете билет в кинотеатр, схема расположения мест задается следующим образом: [0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0], где 1 - занятые места, а 0 - свободные. Вам необходимо выбрать место, которое максимально удалено от занятых, и вывести его индекс.\n",
    "В этом тестовом случае - это место номер 16 (если индексы считать с нуля)."
   ]
  }
 ],
 "metadata": {
  "colab": {
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
